tap "aws/tap"
tap "cantino/mcfly", "https://github.com/cantino/mcfly"
tap "derailed/k9s"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "linuxbrew/xorg"
tap "sourcegraph/src-cli"
# Library for command-line editing
brew "readline"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automatic configure script builder
brew "autoconf"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line benchmark tool
brew "bench"
# CLI for managing secrets through AWS SSM Parameter Store
brew "chamber"
# Diff your Docker containers
brew "container-diff"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# The Kubernetes package manager
brew "helm"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Interactive computing in Python
brew "ipython"
# Little helper to run Rancher Lab's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Rsync for cloud storage
brew "rclone"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Build applications with serverless architectures
brew "serverless"
# Autoformat shell script source code
brew "shfmt"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# The cross-shell prompt for astronauts
brew "starship"
# Free service to share your terminal session with people you trust
brew "teleconsole"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# HTTP load testing tool and library
brew "vegeta"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Sourcegraph CLI
brew "sourcegraph/src-cli/src-cli"
