tap "aws/tap"
tap "cantino/mcfly", "https://github.com/cantino/mcfly"
tap "derailed/k9s"
tap "github/gh"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "linuxbrew/xorg"
tap "sourcegraph/src-cli"
brew "readline"
brew "ansible"
brew "autoconf"
brew "aws-vault"
brew "bat"
brew "bench"
brew "berglas"
brew "black"
brew "caddy"
brew "chamber"
brew "comby"
brew "diff-so-fancy"
brew "docker-compose"
brew "dos2unix"
brew "elm"
brew "exa"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-flow"
brew "gnu-tar"
brew "go"
brew "golang-migrate"
brew "hostess"
brew "httpie"
brew "hub"
brew "ipython"
brew "jsonnet"
brew "k3d"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "mkcert"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "packer"
brew "pipenv"
brew "pipx"
brew "poetry"
brew "pre-commit"
brew "python@3.8"
brew "rclone"
brew "restic"
brew "ripgrep"
brew "screenfetch"
brew "serverless"
brew "shfmt"
brew "skaffold"
brew "socat"
brew "sphinx-doc"
brew "sshuttle"
brew "starship"
brew "teleconsole"
brew "terraform-ls"
brew "tflint"
brew "tree"
brew "vegeta"
brew "watchman"
brew "yarn"
brew "yq"
brew "derailed/k9s/k9s"
brew "go-task/tap/go-task"
brew "sourcegraph/src-cli/src-cli"
